Данное приложение является реализацией командной оболочки (аналога bash) в виде консольного приложения. Внутренний интерпретируемый умеет выполнять следующие команды:

1. pwd – Команда pwd, сокращение от print working directory, отображает текущее местоположение в структуре каталогов. Т.е.вывести на экран текущий рабочий каталог (название и список файлов);

2. cat – Команда cat считывает файл, переданный как аргумент, и выводит его содержимое по стандартному каналу вывода.

3. echo – Команда echo выводит свои аргументы по стандартному каналу вывода.

4. true – Команда true всегда возвращает ноль в качестве выходного статуса для индикации успеха.

5. false – Команда false всегда возвращает не-ноль в качестве выходного статуса для индикации неудачи.

6. ~ (В bash $?) -- это переменная, которая содержит выходной статус последней запущенной команды. Под статусом обычно понимается код возврата программы. 0 означает успешное выполнение программы, любое значение большее 0 отражает тот факт, что в процессе выполнения возникли некоторые ошибки. Кстати, именно поэтому в bash истинной (true) считается 0, а все, что не 0 — ложью (false).

7. Оператор  $ - объявление и присваивание локальных переменных сессии.
Пример: если хотим объявить переменную, но ничего в не присваивать, то пишем: «$ a», если хотим объявить переменную, а также что-то присвоить, то пишем: «$ a = 5» (переопределение переменных производится абсолютно также). Обратите внимание, что пробелы 		обязательны, иначе команда работать не будет!

7*. Оператор @ - нужен для использования тех переменных, которые мы объявили с помощью оператора $. Пример: результат команды «echo @a» будет 5 (с условием того, что она уже объявлена, как было показано в пункте 7).

8.Коннекторы – возможность запускать несколько команд одновременно:
& (В bash &&) – первая команда исполняется всегда, вторая — только в случае успешного завершения первой;
| (В bash ||) – первая команда исполняется всегда, вторая — только в случае неудачного завершения первой;
; – Команды исполняются всегда.

9.Перенаправление вывода:
Для стандартного перенаправления вывода используются символы > и ‘ (В bash >>). Если файл не существует, он создаётся, а если существует, то перезаписывается. Во избежание перезаписи стоит использовать команду ‘ — она дописывает данные в конец файла.

10.wc [FILENAME] – показать на экране количество строк, слов и байт в файле.
